#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int a = 20;
	//00000000000000000000000000010100-源码,反码,补码
	//换成十六进制序列
    //0x000014
	int b = -10;
	//10000000000000000000000000000000-源码
	//11111111111111111111111111110101-反码
	//11111111111111111111111111110110-补码
	//fffffff6
	return 0;
}
int main()
{
	int a = 1;
	char *p = (char*)&a;
	if (*p == 1)
	{
		printf("小端");
	}
	else
	{
		printf("大端");
	}
	return 0;
}
int main()
{
	char a = -1;
	//1000000000000000000000000000001-源码
	//1111111111111111111111111111110-反码
	//1111111111111111111111111111111-补码
	//11111111-a
	//又以整型的方式打印，整型提升，按符号位补1
	//1111111111111111111111111111111
	//1111111111111111111111111111110
	//1000000000000000000000000000001
	//-1
	signed char b = -1;
	unsigned char c = -1;
	//11111111-c
	//对无符号位整型提升，高位补0
	//0000000000000000000000011111111
	printf("%d %d %d", a, b, c);
	return 0;
}

int main()
{
	char a = -128;
	//1000000000000000000000010000000
	//1111111111111111111111101111111
	//1111111111111111111111110000000
	//10000000-a
	//%u-无符号整数
	//1111111111111111111111110000000-补码
	//
	//%u无符号整型
	printf("%u\n", a);
	return 0;
}
int main()
{
	int i = -20;
	unsigned int j = 10;
	//10000000000000000000000000010100-补码
	//11111111111111111111111111101011-反码
	//11111111111111111111111111101100-源码
	//00000000000000000000000000001010
	//11111111111111111111111111110110//i+j
	//11111111111111111111111111110101//反码
	//10000000000000000000000000001010
	printf("%d", i + j);
	return 0;
}
int main()
{
	char ch = 'a';
	char*pc = &ch;
	char*p = "abcdef";
	//将首字符a的地址放入p中
	return 0;
}
int main()
{
	int a = 10;
	int *p = &a;
	char ch = 'w';
	char*pc = &ch;
	int arr[10] = { 0 };
	int(*pa)[10] = &arr;
	//pa就是一个指向数组的指针
	//&arr数组名是整个数组，取出的是数组的地址
	return 0;
}
int main()
{
	int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	int(*p)[10] = &arr;
	int i = 0;
	for (i = 0; i < 10; i++)
	{
		printf("%d ", (*p)[i]);
	}
	return 0;
}